Modul3/perpustakaan/src/main/resources/request/getBooks.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:gs="http://www.polstat.com/perpustakaan/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getBooksRequest>
        </gs:getBooksRequest>
    </soapenv:Body>
</soapenv:Envelope>